# Pandas Cont.
## dealing with external data

In [1]:
import pandas as pd
import numpy as np

In [2]:
tit = pd.read_csv('titanic.csv')
tit

,PassengerId,Survived,Pclass,Lname,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,Braund,Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,Heikkinen,Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,Futrelle,Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,Allen,Mr. William Henry,male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,Pears,Mrs. Thomas (Edith Wearne),female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,Meo,Mr. Alfonzo,male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,van Billiard,Mr. Austin Blyler,male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,Olsen,Mr. Ole Martin,male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,Williams,Mr. Charles Duane,male,51.0,0,1,PC 17597,61.3792,NaN,C

In [3]:
tit.head()

,PassengerId,Survived,Pclass,Lname,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,Braund,Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,Heikkinen,Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,Futrelle,Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,Allen,Mr. William Henry,male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
tit['Age'].mean()

28.141507936507935

In [5]:
tit['Fare'].median()

14.4542

In [6]:
tit['Pclass'].mode()

0    3
Name: Pclass, dtype: int64

In [7]:
# to get freq of something

tit['Ticket'].count()

156

In [8]:
tit['Fare'].std()

39.401046696492585

In [9]:
tit['Fare'].max()

263.0

In [10]:
tit.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

In [11]:
# frequency table
# how many people survived or not survived

tit.Survived.value_counts()

0    102
1     54
Name: Survived, dtype: int64

In [13]:
tit['Survived'].value_counts()

0    102
1     54
Name: Survived, dtype: int64

In [14]:
tit.Pclass.value_counts()

3    96
1    30
2    30
Name: Pclass, dtype: int64

In [16]:
# relative frequency table
tit.Pclass.value_counts(normalize= True)

3    0.615385
1    0.192308
2    0.192308
Name: Pclass, dtype: float64

In [17]:
tit.Pclass.value_counts

<bound method IndexOpsMixin.value_counts of 0      3
1      1
2      3
3      1
4      3
      ..
151    1
152    3
153    3
154    3
155    1
Name: Pclass, Length: 156, dtype: int64>

In [18]:
tit['Pclass'].value_counts

<bound method IndexOpsMixin.value_counts of 0      3
1      1
2      3
3      1
4      3
      ..
151    1
152    3
153    3
154    3
155    1
Name: Pclass, Length: 156, dtype: int64>

In [19]:
tit.Pclass.value_counts(normalize= True,sort=True,ascending=True,dropna=True)

1    0.192308
2    0.192308
3    0.615385
Name: Pclass, dtype: float64

In [22]:
tit.Age.value_counts(normalize = True, sort= True,ascending = True, dropna = True)

40.50    0.007937
3.00     0.007937
12.00    0.007937
49.00    0.007937
55.50    0.007937
65.00    0.007937
28.50    0.007937
5.00     0.007937
11.00    0.007937
0.83     0.007937
30.00    0.007937
46.00    0.007937
59.00    0.007937
71.00    0.007937
14.50    0.007937
70.50    0.007937
36.50    0.007937
66.00    0.007937
7.00     0.007937
9.00     0.007937
8.00     0.007937
15.00    0.007937
31.00    0.007937
55.00    0.007937
39.00    0.007937
58.00    0.007937
32.50    0.015873
47.00    0.015873
37.00    0.015873
54.00    0.015873
25.00    0.015873
51.00    0.015873
32.00    0.015873
40.00    0.015873
45.00    0.015873
4.00     0.015873
42.00    0.015873
18.00    0.023810
35.00    0.023810
34.00    0.023810
17.00    0.023810
2.00     0.023810
23.00    0.023810
33.00    0.023810
27.00    0.023810
14.00    0.023810
16.00    0.023810
26.00    0.031746
38.00    0.031746
20.00    0.031746
28.00    0.039683
24.00    0.039683
22.00    0.047619
19.00    0.047619
29.00    0.047619
21.00    0.063492
Name: Age, dtype: float64

In [23]:
tit.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Lname', 'Name', 'Sex', 'Age',
       'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [25]:
# contigency table - relationship btw two columns
pd.crosstab(index=tit['Pclass'],columns=tit['Survived'])
# here relation betweeen survived or not with respect to class of passenger

Survived   0   1
Pclass
1         18  12
2         16  14
3         68  28

In [26]:
# fro relative freq
pd.crosstab(index=tit['Pclass'],columns=tit['Survived'],normalize=True)

Survived         0         1
Pclass
1         0.115385  0.076923
2         0.102564  0.089744
3         0.435897  0.179487

In [27]:
# to get the row column total
pd.crosstab(index=tit['Pclass'],columns=tit['Survived'],margins=True)

Survived    0   1  All
Pclass
1          18  12   30
2          16  14   30
3          68  28   96
All       102  54  156

In [28]:
pd.crosstab(index=tit['Pclass'],columns=tit['Survived'],margins=True,normalize=True)

Survived         0         1       All
Pclass
1         0.115385  0.076923  0.192308
2         0.102564  0.089744  0.192308
3         0.435897  0.179487  0.615385
All       0.653846  0.346154  1.000000

In [29]:
# row relative frequency
pd.crosstab(index=tit['Pclass'],columns=tit['Survived'],margins=True,normalize='index')

Survived         0         1
Pclass
1         0.600000  0.400000
2         0.533333  0.466667
3         0.708333  0.291667
All       0.653846  0.346154

In [30]:
# column relative frequency
pd.crosstab(index=tit['Pclass'],columns=tit['Survived'],margins=True,normalize='columns')

Survived         0         1       All
Pclass
1         0.176471  0.222222  0.192308
2         0.156863  0.259259  0.192308
3         0.666667  0.518519  0.615385

In [31]:
# column relative frequency
col_rel_fre = pd.crosstab(index=tit['Pclass'],columns=tit['Survived'],margins=True,normalize='columns')
col_rel_fre

Survived         0         1       All
Pclass
1         0.176471  0.222222  0.192308
2         0.156863  0.259259  0.192308
3         0.666667  0.518519  0.615385

In [37]:
col_rel_fre = pd.crosstab(index=tit['Pclass'],columns=tit['Survived'],margins=True,normalize='columns')
print(col_rel_fre)
print(col_rel_fre[1])
print(col_rel_fre.iloc[1,0])

Survived         0         1       All
Pclass
1         0.176471  0.222222  0.192308
2         0.156863  0.259259  0.192308
3         0.666667  0.518519  0.615385
Pclass
1    0.222222
2    0.259259
3    0.518519
Name: 1, dtype: float64
0.1568627450980392

In [40]:
# covariance matrix
tit.cov()

C:\Users\ANSIL M B\AppData\Local\Temp\ipykernel_13320\3377862312.py:2: FutureWarning: The default value of numeric_only in DataFrame.cov is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  tit.cov()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,2041.000000,-4.161290,0.438710,50.442418,-6.509677,-1.070968,-48.277466
Survived,-4.161290,0.227792,-0.044169,-0.827775,-0.033747,0.016377,0.551794
Pclass,0.438710,-0.044169,0.632754,-4.300679,0.073449,0.011414,-19.032549
Age,50.442418,-0.827775,-4.300679,213.565487,-6.508754,-2.940380,14.897661
SibSp,-6.509677,-0.033747,0.073449,-6.508754,1.115633,0.366749,11.319654
Parch,-1.070968,0.016377,0.011414,-2.940380,0.366749,0.757155,8.736486
Fare,-48.277466,0.551794,-19.032549,14.897661,11.319654,8.736486,1552.442481

In [41]:
# correlation matrix
tit.corr()

C:\Users\ANSIL M B\AppData\Local\Temp\ipykernel_13320\736508638.py:2: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  tit.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.192991,0.012208,0.075021,-0.136420,-0.027243,-0.027122
Survived,-0.192991,1.000000,-0.116340,-0.120416,-0.066943,0.039435,0.029343
Pclass,0.012208,-0.116340,1.000000,-0.362627,0.087420,0.016491,-0.607256
Age,0.075021,-0.120416,-0.362627,1.000000,-0.393500,-0.215169,0.024494
SibSp,-0.136420,-0.066943,0.087420,-0.393500,1.000000,0.399040,0.271997
Parch,-0.027243,0.039435,0.016491,-0.215169,0.399040,1.000000,0.254822
Fare,-0.027122,0.029343,-0.607256,0.024494,0.271997,0.254822,1.000000

In [42]:
tit["Survived"].corr(tit['Age'])

-0.1204163477681382

In [44]:
df = pd.DataFrame({'Age':[1,2,3,4,5],'Gender':['M','F','F','M','M'],'Height':[75,85,94,101,108]})
df

   Age Gender  Height
0    1      M      75
1    2      F      85
2    3      F      94
3    4      M     101
4    5      M     108

In [48]:
df.Gender.value_counts() # frequency

M    3
F    2
Name: Gender, dtype: int64

In [47]:
df.Gender.value_counts(normalize=True) # relative freq

M    0.6
F    0.4
Name: Gender, dtype: float64

In [49]:
df.cov()

C:\Users\ANSIL M B\AppData\Local\Temp\ipykernel_13320\1545644723.py:1: FutureWarning: The default value of numeric_only in DataFrame.cov is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.cov()

         Age  Height
Age      2.5    20.5
Height  20.5   169.3

In [50]:
df['Age'].corr(df['Height'])

0.9964496929345307